// 상위 카테고리
export type SurgeryCategory = {
  name: string;
  children: (string | SurgerySubCategory)[];
};

// 하위 카테고리
export type SurgerySubCategory = {
  name: string;
  subItems: string[];
};

// 세부 카테고리
export const SURGERY_CATEGORIES: SurgeryCategory[] = [
  {
    name: '눈',
    children: [
      {
        name: '쌍꺼풀',
        subItems: [
          '자연유착 쌍커풀',
          '매몰 쌍커풀',
          '절개 쌍커풀',
          '부분절개 쌍커풀',
        ],
      },
      {
        name: '트임',
        subItems: ['앞트임', '뒤트임', '밑트임', '몽고트임', '트임복원'],
      },
      {
        name: '눈매교정',
        subItems: ['절개 눈매교정', '비절개 눈매교정'],
      },
      {
        name: '눈모양교정',
        subItems: [
          '눈밑지방재배치',
          '상안검',
          '하안검',
          '눈썹거상',
          '눈및지방재배치',
        ],
      },
      {
        name: '눈재수술',
        subItems: [
          '쌍커풀 눈재수술',
          '트임 눈재수술',
          '눈매교정 눈재수술',
          '눈모양교정 눈재수술',
        ],
      },
    ],
  },
  {
    name: '코',
    children: [
      {
        name: '콧대',
        subItems: ['콧대(자가조직)', '콧대(보형물)', '코절골술'],
      },
      {
        name: '코끝',
        subItems: ['코끝(자가조직)', '코끝(보형물)', '코길이연장'],
      },
      {
        name: '콧볼',
        subItems: ['비절개콧볼', '내측절개 콧볼'],
      },
      {
        name: '기능코',
        subItems: [
          '비염/축농증 기능코',
          '비밸브협착 기능코',
          '비중격만곡 기능코',
        ],
      },
      {
        name: '코재수술',
        subItems: [
          '콧대 코재수술',
          '코끝 코재수술',
          '콧볼 코재수술',
          '기능코 코재수술',
        ],
      },
    ],
  },
  {
    name: '지방흡입/이식',
    children: [
      {
        name: '바디지방흡입',
        subItems: [
          '복부 바디지방흡입',
          '팔 바디지방흡입',
          '허벅지 바디지방흡입',
          '무릎/종아리/발목 바디지방흡입',
          '엉덩이 바디지방흡입',
          '승모근/쇄골/등 바디지방흡입',
          '옆구리/러브핸들 바디지방흡입',
          '가슴 바디지방흡입',
          '겨드랑이/부유방 바디지방흡입',
          '전신 바디지방흡입',
        ],
      },
      {
        name: '얼굴지방흡입',
        subItems: [
          '풀페이스 얼굴지방흡입',
          '이마/미간 얼굴지방흡입',
          '볼/광대 얼굴지방흡입',
          '턱 얼굴지방흡입',
          '팔자 얼굴지방흡입',
        ],
      },
      {
        name: '바디지방이식',
        subItems: [
          '가슴 바디지방이식',
          '엉덩이 바디지방이식',
          '종아리 바디지방이식',
        ],
      },
      {
        name: '얼굴지방이식',
        subItems: [
          '풀페이스 얼굴지방이식',
          '이마/미간 얼굴지방이식',
          '볼/광대 얼굴지방이식',
          '눈 얼굴지방이식',
          '턱 얼굴지방이식',
          '관자놀이 얼굴지방이식',
          '팔자 얼굴지방이식',
          '입술 얼굴지방이식',
        ],
      },
    ],
  },
  {
    name: '안면윤곽/양악',
    children: [
      {
        name: '광대',
        subItems: ['광대확대(보형물)', '광대축소'],
      },
      {
        name: '윤곽',
        subItems: ['사각턱', '턱끝', '이중턱', '복합안면 V라인', '안면거상'],
      },
      {
        name: '이마',
        subItems: ['이마확대(보형물)', '이마축소', '이마거상'],
      },
      {
        name: '양악',
        subItems: ['양악', '상악', '하악'],
      },
      {
        name: '안면윤곽재수술',
        subItems: [
          '광대 안면윤곽재수술',
          '윤곽 안면윤곽재수술',
          '이마 안면윤곽재수술',
          '양악 안면윤곽재수술',
        ],
      },
    ],
  },
  {
    name: '가슴',
    children: [
      {
        name: '가슴모양교정',
        subItems: ['가슴확대(보형물)'],
      },
      {
        name: '유두/유륜',
        subItems: ['함몰유두', '유두/유륜축소'],
      },
      {
        name: '가슴재수술',
        subItems: ['가슴모양교정 가슴재수술', '유두/유륜 가슴재수술'],
      },
    ],
  },
  {
    name: '기타',
    children: [
      {
        name: '기타',
        subItems: [
          '여성성형',
          '바디거상',
          '입술성형',
          '인중성형',
          '팔자성형',
          '보조개성형',
          '엉덩이성형',
          '귀성형',
        ],
      },
    ],
  },
];
